app/controllers/station_controller.rb

SELECT  "stations".* FROM "stations"  WHERE "stations"."id" = $1 LIMIT 1  [["id", 257]]
---
def data
    near_me_long = params[:nearMeLong]
	near_me_lat = params[:nearMeLat]

    if params[:station_select] != "" && near_me_long == "none"
       @station_select = Station.find(params[:station_select].split("_")[1])

SELECT "stations".* FROM "stations"  WHERE "stations"."cross_st1" = ' W 41 St'
SELECT "stations".* FROM "stations"  WHERE "stations"."cross_st2" = ' W 41 St'
SELECT "stations".* FROM "stations"  WHERE "stations"."cross_st1" = 'W 41 St ' AND "stations"."cross_st2" = ' 11 Ave'
---
 def find_station(array1, array2)
 	stationlist = [];
	 if !array2
		if Station.where("cross_st1" => array1[0])
			for a in Station.where("cross_st1" => array1[0])
				stationlist << a
			end
		end
		if Station.where("cross_st1" => array1[1])
			for a in Station.where("cross_st1" => array1[1])
				stationlist << a
			end
		end
		if Station.where("cross_st2" => array1[0])
			for a in Station.where("cross_st2" => array1[0])
				stationlist << a
			end
		end
		if Station.where("cross_st2" => array1[1])
			for a in Station.where("cross_st2" => array1[1])
				stationlist << a
			end
		end
	else
		if Station.where("cross_st1" => array1[1], "cross_st2" => array2[0])