app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "pwd", "uname", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-07-07 20:41:01.619909"], ["email", "john@email.com"], ["pwd", "1234"], ["uname", "john334"], ["updated_at", "2014-07-07 20:41:01.619909"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save